/*###################################################
##  文件: camera.cpp
##  文件描述：实现camera所需要的功能
##  参数描述：无
#####################################################*/
#include "Camera.h"
using namespace std;

/*###################################################
##  函数: Camera()
##  函数描述：默认构造函数
##  参数描述：无
#####################################################*/
Camera::Camera()
{
	cout << "-- Creating camera\n";
	reset();
}

/*###################################################
##  函数: ~Camera()
##  函数描述：默认析构函数
##  参数描述：无
#####################################################*/
Camera::~Camera()
{
	cout << "++ Destructing camera\n";
}

/*###################################################
##  函数: reset()
##  函数描述：复位函数，将camera复位到默认位置和倾斜角度
##  参数描述：无
#####################################################*/
void Camera::reset(void)
{
	this->distance = -50.0f;
	this->verticalTilt = -30.0f;
	this->horizontalAngle = 90.0f;
}

/*###################################################
##  函数: position()
##  函数描述：用于改变camera位置的函数， 根据属性将camera调整至相应的位置和倾斜角
##  参数描述：无
#####################################################*/
void Camera::position(void)
{
	glTranslatef(0.0f, 0.0f, this->distance);
	glRotatef(this->verticalTilt, 1.0f, 0.0f, 0.0f);
	glRotatef(this->horizontalAngle, 0.0f, 1.0f, 0.0f);
}

/*###################################################
##  函数: dec()
##  函数描述：拉近camera，放大图像
##  参数描述：无
#####################################################*/
void Camera::dec(void)
{
    this->distance--;
}

/*###################################################
##  函数: inc()
##  函数描述：拉远camera，缩小图像
##  参数描述：无
#####################################################*/
void Camera::inc(void)
{
	this->distance++;
}

/*###################################################
##  函数: clockwise()
##  函数描述：正向调整camera在Y轴的倾斜角
##  参数描述：无
#####################################################*/
void Camera::clockwise(void)
{
	this->horizontalAngle++;
}

/*###################################################
##  函数: anticlockwise()
##  函数描述：反向调整camera在Y轴的倾斜角
##  参数描述：无
#####################################################*/
void Camera::anticlockwise(void)
{
	this->horizontalAngle--;
}

/*###################################################
##  函数: anticlockwise()
##  函数描述：正向调整camera在X轴的倾斜角，若小于0度则无法调整
##  参数描述：无
#####################################################*/
void Camera::tiltup(void)
{
	if (this->verticalTilt < 0)
		this->verticalTilt++;
}

/*###################################################
##  函数: anticlockwise()
##  函数描述：反向调整camera在X轴的倾斜角，若大于90度则无法调整
##  参数描述：无
#####################################################*/
void Camera::tiltdown(void)
{
	if (this->verticalTilt > -90)
		this->verticalTilt--;
}
